GopalSaraf/Practicals/PSDL/include/proc/pic16f506.h
// Register: ADRES
#define ADRES ADRES
extern volatile unsigned char           ADRES               __at(0x00A);
#ifndef _LIB_BUILD
asm("ADRES equ 0Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES                  :8;
    };
} ADRESbits_t;
extern volatile ADRESbits_t ADRESbits __at(0x00A);
// bitfield macros
#define _ADRES_ADRES_POSN                                   0x0
#define _ADRES_ADRES_POSITION                               0x0
#define _ADRES_ADRES_SIZE                                   0x8
#define _ADRES_ADRES_LENGTH                                 0x8
#define _ADRES_ADRES_MASK                                   0xFF

// Register: CM2CON0
#define CM2CON0 CM2CON0
extern volatile unsigned char           CM2CON0             __at(0x00B);
#ifndef _LIB_BUILD
asm("CM2CON0 equ 0Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned nC2WU                  :1;
        unsigned C2PREF1                :1;
        unsigned C2NREF                 :1;
        unsigned C2ON                   :1;
        unsigned C2PREF2                :1;
        unsigned C2POL                  :1;
        unsigned nC2OUTEN               :1;
        unsigned C2OUT                  :1;
    };
} CM2CON0bits_t;
extern volatile CM2CON0bits_t CM2CON0bits __at(0x00B);
// bitfield macros
#define _CM2CON0_nC2WU_POSN                                 0x0
#define _CM2CON0_nC2WU_POSITION                             0x0
#define _CM2CON0_nC2WU_SIZE                                 0x1
#define _CM2CON0_nC2WU_LENGTH                               0x1
#define _CM2CON0_nC2WU_MASK                                 0x1
#define _CM2CON0_C2PREF1_POSN                               0x1
#define _CM2CON0_C2PREF1_POSITION                           0x1
#define _CM2CON0_C2PREF1_SIZE                               0x1
#define _CM2CON0_C2PREF1_LENGTH                             0x1
#define _CM2CON0_C2PREF1_MASK                               0x2
#define _CM2CON0_C2NREF_POSN                                0x2
#define _CM2CON0_C2NREF_POSITION                            0x2
#define _CM2CON0_C2NREF_SIZE                                0x1
#define _CM2CON0_C2NREF_LENGTH                              0x1
#define _CM2CON0_C2NREF_MASK                                0x4
#define _CM2CON0_C2ON_POSN                                  0x3
#define _CM2CON0_C2ON_POSITION                              0x3
#define _CM2CON0_C2ON_SIZE                                  0x1
#define _CM2CON0_C2ON_LENGTH                                0x1
#define _CM2CON0_C2ON_MASK                                  0x8
#define _CM2CON0_C2PREF2_POSN                               0x4
#define _CM2CON0_C2PREF2_POSITION                           0x4
#define _CM2CON0_C2PREF2_SIZE                               0x1
#define _CM2CON0_C2PREF2_LENGTH                             0x1
#define _CM2CON0_C2PREF2_MASK                               0x10
#define _CM2CON0_C2POL_POSN                                 0x5
#define _CM2CON0_C2POL_POSITION                             0x5
#define _CM2CON0_C2POL_SIZE                                 0x1
#define _CM2CON0_C2POL_LENGTH                               0x1
#define _CM2CON0_C2POL_MASK                                 0x20
#define _CM2CON0_nC2OUTEN_POSN                              0x6
#define _CM2CON0_nC2OUTEN_POSITION                          0x6
#define _CM2CON0_nC2OUTEN_SIZE                              0x1
#define _CM2CON0_nC2OUTEN_LENGTH                            0x1
#define _CM2CON0_nC2OUTEN_MASK                              0x40
#define _CM2CON0_C2OUT_POSN                                 0x7
#define _CM2CON0_C2OUT_POSITION                             0x7
#define _CM2CON0_C2OUT_SIZE                                 0x1
#define _CM2CON0_C2OUT_LENGTH                               0x1
#define _CM2CON0_C2OUT_MASK                                 0x80

// Register: VRCON
#define VRCON VRCON
extern volatile unsigned char           VRCON               __at(0x00C);
#ifndef _LIB_BUILD
asm("VRCON equ 0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VR                     :4;
        unsigned                        :1;
        unsigned VRR                    :1;
        unsigned VROE                   :1;
        unsigned VREN                   :1;
    };
    struct {
        unsigned VR0                    :1;
        unsigned VR1                    :1;
        unsigned VR2                    :1;
        unsigned VR3                    :1;
    };
} VRCONbits_t;
extern volatile VRCONbits_t VRCONbits __at(0x00C);
// bitfield macros
#define _VRCON_VR_POSN                                      0x0
#define _VRCON_VR_POSITION                                  0x0
#define _VRCON_VR_SIZE                                      0x4
#define _VRCON_VR_LENGTH                                    0x4
#define _VRCON_VR_MASK                                      0xF
#define _VRCON_VRR_POSN                                     0x5
#define _VRCON_VRR_POSITION                                 0x5
#define _VRCON_VRR_SIZE                                     0x1
#define _VRCON_VRR_LENGTH                                   0x1
#define _VRCON_VRR_MASK                                     0x20
#define _VRCON_VROE_POSN                                    0x6
#define _VRCON_VROE_POSITION                                0x6
#define _VRCON_VROE_SIZE                                    0x1
#define _VRCON_VROE_LENGTH                                  0x1
#define _VRCON_VROE_MASK                                    0x40
#define _VRCON_VREN_POSN                                    0x7
#define _VRCON_VREN_POSITION                                0x7
#define _VRCON_VREN_SIZE                                    0x1
#define _VRCON_VREN_LENGTH                                  0x1
#define _VRCON_VREN_MASK                                    0x80
#define _VRCON_VR0_POSN                                     0x0
#define _VRCON_VR0_POSITION                                 0x0
#define _VRCON_VR0_SIZE                                     0x1
#define _VRCON_VR0_LENGTH                                   0x1
#define _VRCON_VR0_MASK                                     0x1
#define _VRCON_VR1_POSN                                     0x1
#define _VRCON_VR1_POSITION                                 0x1
#define _VRCON_VR1_SIZE                                     0x1
#define _VRCON_VR1_LENGTH                                   0x1
#define _VRCON_VR1_MASK                                     0x2
#define _VRCON_VR2_POSN                                     0x2
#define _VRCON_VR2_POSITION                                 0x2
#define _VRCON_VR2_SIZE                                     0x1
#define _VRCON_VR2_LENGTH                                   0x1
#define _VRCON_VR2_MASK                                     0x4
#define _VRCON_VR3_POSN                                     0x3
#define _VRCON_VR3_POSITION                                 0x3
#define _VRCON_VR3_SIZE                                     0x1
#define _VRCON_VR3_LENGTH                                   0x1
#define _VRCON_VR3_MASK                                     0x8

// Register: OPTION
#define OPTION OPTION
extern volatile __control unsigned char OPTION              __at(0x000);

// Register: TRISB
#define TRISB TRISB
extern volatile __control unsigned char TRISB               __at(0x006);

// Register: TRISC
#define TRISC TRISC
extern volatile __control unsigned char TRISC               __at(0x007);

